In [2]:
import numpy as np

In [15]:
import pandas as pd

In [17]:
labels = ["a","b","c"]
labels

['a', 'b', 'c']

In [5]:
my_data = [1,2,3]

In [20]:
arr = np.array(my_data)

In [7]:
d = {"1":"I","2":"love","3": "python"}

In [8]:
d

{'1': 'I', '2': 'love', '3': 'python'}

In [18]:
pd.Series(data=my_data, index = labels)

a    1
b    2
c    3
dtype: int64

In [19]:
pd.Series(my_data,labels)

a    1
b    2
c    3
dtype: int64

In [21]:
pd.Series(arr)

0    1
1    2
2    3
dtype: int64

In [27]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [28]:
pd.Series(data = [sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [29]:
ser = pd.Series([1,2,3],["usa","Germany","france"])
ser

usa        1
Germany    2
france     3
dtype: int64

In [37]:
ser["france"]

3

In [38]:
ser1 = pd.Series([1,2,3],["usa","italy","france"])

In [34]:
ser2 = pd.Series(data = labels)
ser2

0    a
1    b
2    c
dtype: object

In [35]:
ser2[2]

'c'

In [39]:
ser + ser1

Germany    NaN
france     6.0
italy      NaN
usa        2.0
dtype: float64

Pandas --- Data frames

In [46]:
np.random.seed(101)

In [47]:
from numpy.random import randn

In [48]:
df = pd.DataFrame(randn(5,4),["x","y","z","a","b"],['a','b','c','d'])

In [49]:
df

          a         b         c         d
x  2.706850  0.628133  0.907969  0.503826
y  0.651118 -0.319318 -0.848077  0.605965
z -2.018168  0.740122  0.528813 -0.589001
a  0.188695 -0.758872 -0.933237  0.955057
b  0.190794  1.978757  2.605967  0.683509

In [50]:
df1 = pd.DataFrame(randn(2,3),['1990','1995'],['a','b','c'])

In [51]:
df1

             a         b         c
1990  0.302665  1.693723 -1.706086
1995 -1.159119 -0.134841  0.390528

In [52]:
df['b']

x    0.628133
y   -0.319318
z    0.740122
a   -0.758872
b    1.978757
Name: b, dtype: float64

In [54]:
type(df['b'])

pandas.core.series.Series

In [55]:
type(df)

pandas.core.frame.DataFrame

In [57]:
df['d']

x    0.503826
y    0.605965
z   -0.589001
a    0.955057
b    0.683509
Name: d, dtype: float64

In [59]:
df[['a','c']]

          a         c
x  2.706850  0.907969
y  0.651118 -0.848077
z -2.018168  0.528813
a  0.188695 -0.933237
b  0.190794  2.605967

In [60]:
df["new"]

KeyError: 'new'

In [64]:
df['new']= df['a'] + df['b']
df

          a         b         c         d       new
x  2.706850  0.628133  0.907969  0.503826  3.334983
y  0.651118 -0.319318 -0.848077  0.605965  0.331800
z -2.018168  0.740122  0.528813 -0.589001 -1.278046
a  0.188695 -0.758872 -0.933237  0.955057 -0.570177
b  0.190794  1.978757  2.605967  0.683509  2.169552

In [66]:
df.drop('new', axis = 1)

          a         b         c         d
x  2.706850  0.628133  0.907969  0.503826
y  0.651118 -0.319318 -0.848077  0.605965
z -2.018168  0.740122  0.528813 -0.589001
a  0.188695 -0.758872 -0.933237  0.955057
b  0.190794  1.978757  2.605967  0.683509

In [67]:
df

          a         b         c         d       new
x  2.706850  0.628133  0.907969  0.503826  3.334983
y  0.651118 -0.319318 -0.848077  0.605965  0.331800
z -2.018168  0.740122  0.528813 -0.589001 -1.278046
a  0.188695 -0.758872 -0.933237  0.955057 -0.570177
b  0.190794  1.978757  2.605967  0.683509  2.169552

In [68]:
df.drop('new', axis = 1, inplace=True)

In [69]:
df

          a         b         c         d
x  2.706850  0.628133  0.907969  0.503826
y  0.651118 -0.319318 -0.848077  0.605965
z -2.018168  0.740122  0.528813 -0.589001
a  0.188695 -0.758872 -0.933237  0.955057
b  0.190794  1.978757  2.605967  0.683509

In [73]:
df.drop('b',axis= 0,inplace= True)

In [74]:
df

          a         b         c         d
x  2.706850  0.628133  0.907969  0.503826
y  0.651118 -0.319318 -0.848077  0.605965
z -2.018168  0.740122  0.528813 -0.589001
a  0.188695 -0.758872 -0.933237  0.955057

In [75]:
df[['a','b']]

          a         b
x  2.706850  0.628133
y  0.651118 -0.319318
z -2.018168  0.740122
a  0.188695 -0.758872

In [76]:
#rows

In [86]:
df.loc['x']

a    2.706850
b    0.628133
c    0.907969
d    0.503826
Name: x, dtype: float64

In [87]:
df.loc['a','a']

0.18869530944922425

In [84]:
df.iloc[0]

a    2.706850
b    0.628133
c    0.907969
d    0.503826
Name: x, dtype: float64

In [85]:
df.iloc[0,1]

0.6281327087844596

In [88]:
df

          a         b         c         d
x  2.706850  0.628133  0.907969  0.503826
y  0.651118 -0.319318 -0.848077  0.605965
z -2.018168  0.740122  0.528813 -0.589001
a  0.188695 -0.758872 -0.933237  0.955057

In [89]:
df.loc[['x','z'],['a','c']]

          a         c
x  2.706850  0.907969
z -2.018168  0.528813

In [90]:
##conditional selection

In [91]:
df >0

       a      b      c      d
x   True   True   True   True
y   True  False  False   True
z  False   True   True  False
a   True  False  False   True

In [92]:
booldf = df >0

In [94]:
df[booldf]

          a         b         c         d
x  2.706850  0.628133  0.907969  0.503826
y  0.651118       NaN       NaN  0.605965
z       NaN  0.740122  0.528813       NaN
a  0.188695       NaN       NaN  0.955057

In [97]:
df[df >0]

          a         b         c         d
x  2.706850  0.628133  0.907969  0.503826
y  0.651118       NaN       NaN  0.605965
z       NaN  0.740122  0.528813       NaN
a  0.188695       NaN       NaN  0.955057

In [102]:
df.loc['y'] >0

a     True
b    False
c    False
d     True
Name: y, dtype: bool

In [103]:
df['b']>0

x     True
y    False
z     True
a    False
Name: b, dtype: bool

In [104]:
df['b']<0

x    False
y     True
z    False
a     True
Name: b, dtype: bool

In [105]:
df <0

       a      b      c      d
x  False  False  False  False
y  False   True   True  False
z   True  False  False   True
a  False   True   True  False

In [107]:
df[df['a'] >0]

          a         b         c         d
x  2.706850  0.628133  0.907969  0.503826
y  0.651118 -0.319318 -0.848077  0.605965
a  0.188695 -0.758872 -0.933237  0.955057

In [108]:
df[df['a'] <0]

          a         b         c         d
z -2.018168  0.740122  0.528813 -0.589001

In [109]:
result_df = df[df['c']>0]

In [110]:
result_df

          a         b         c         d
x  2.706850  0.628133  0.907969  0.503826
z -2.018168  0.740122  0.528813 -0.589001

In [111]:
result_df['c']

x    0.907969
z    0.528813
Name: c, dtype: float64

In [114]:
df[df['b'] > 0][['c','d']]

          c         d
x  0.907969  0.503826
z  0.528813 -0.589001

In [ ]:
## multiple condition

In [115]:
df

          a         b         c         d
x  2.706850  0.628133  0.907969  0.503826
y  0.651118 -0.319318 -0.848077  0.605965
z -2.018168  0.740122  0.528813 -0.589001
a  0.188695 -0.758872 -0.933237  0.955057

In [122]:
df[(df['c'] >0) &(df['a'] >1) ]

         a         b         c         d
x  2.70685  0.628133  0.907969  0.503826

In [123]:
df[(df['c'] >0) | (df['a'] >1) ]

          a         b         c         d
x  2.706850  0.628133  0.907969  0.503826
z -2.018168  0.740122  0.528813 -0.589001

In [125]:
df.reset_index()

  index         a         b         c         d
0     x  2.706850  0.628133  0.907969  0.503826
1     y  0.651118 -0.319318 -0.848077  0.605965
2     z -2.018168  0.740122  0.528813 -0.589001
3     a  0.188695 -0.758872 -0.933237  0.955057

In [127]:
df.reset_index(inplace= True)

In [130]:
df.reset_index()

   level_0 index         a         b         c         d
0        0     x  2.706850  0.628133  0.907969  0.503826
1        1     y  0.651118 -0.319318 -0.848077  0.605965
2        2     z -2.018168  0.740122  0.528813 -0.589001
3        3     a  0.188695 -0.758872 -0.933237  0.955057

In [131]:
df

  index         a         b         c         d
0     x  2.706850  0.628133  0.907969  0.503826
1     y  0.651118 -0.319318 -0.848077  0.605965
2     z -2.018168  0.740122  0.528813 -0.589001
3     a  0.188695 -0.758872 -0.933237  0.955057

In [1]:
newind = 'ca fr in ru us nl nor '.split()

In [2]:
newind = 'fr ru nl nor'.split()

In [3]:
newind

['fr', 'ru', 'nl', 'nor']

In [136]:
df['States'] = newind

In [137]:
df

  index         a         b         c         d States
0     x  2.706850  0.628133  0.907969  0.503826     fr
1     y  0.651118 -0.319318 -0.848077  0.605965     ru
2     z -2.018168  0.740122  0.528813 -0.589001     nl
3     a  0.188695 -0.758872 -0.933237  0.955057    nor

In [138]:
df.set_index('States')

       index         a         b         c         d
States
fr         x  2.706850  0.628133  0.907969  0.503826
ru         y  0.651118 -0.319318 -0.848077  0.605965
nl         z -2.018168  0.740122  0.528813 -0.589001
nor        a  0.188695 -0.758872 -0.933237  0.955057

In [139]:
    # index levels

In [200]:
outside = ['G1','G1','G1','G2','G2','G2']
Inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,Inside))

In [201]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [202]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [203]:
#index hierarchy

In [206]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [207]:
df

             A         B
G1 1  1.259904 -0.447898
   2  0.266207  0.412580
   3  0.988773  0.513833
G2 1 -0.928205  0.846904
   2 -0.298436  0.029141
   3  0.889031 -1.839261

In [208]:
df.loc['G1']

          A         B
1  1.259904 -0.447898
2  0.266207  0.412580
3  0.988773  0.513833

In [211]:
df.loc['G1'].loc[1]

A    1.259904
B   -0.447898
Name: 1, dtype: float64

In [212]:
df

             A         B
G1 1  1.259904 -0.447898
   2  0.266207  0.412580
   3  0.988773  0.513833
G2 1 -0.928205  0.846904
   2 -0.298436  0.029141
   3  0.889031 -1.839261

In [213]:
df.index.names = ['groupes','numb']

In [214]:
df

                     A         B
groupes numb
G1      1     1.259904 -0.447898
        2     0.266207  0.412580
        3     0.988773  0.513833
G2      1    -0.928205  0.846904
        2    -0.298436  0.029141
        3     0.889031 -1.839261

In [216]:
df.loc['G2'].loc[1]['B']

0.8469038980594052

In [217]:
df.loc['G1'].loc[2]['A']

0.26620677922249886

In [218]:
df

                     A         B
groupes numb
G1      1     1.259904 -0.447898
        2     0.266207  0.412580
        3     0.988773  0.513833
G2      1    -0.928205  0.846904
        2    -0.298436  0.029141
        3     0.889031 -1.839261

In [222]:
df.xs(1,level='numb')

                A         B
groupes
G1       1.259904 -0.447898
G2      -0.928205  0.846904

In [223]:
##Missing Data

In [228]:
d = { 'A':[1,2,np.nan],'B':[1,np.nan,np.nan],'C':[1,np.nan,3]}

In [231]:
df = pd.DataFrame(d)

In [232]:
df

     A    B    C
0  1.0  1.0  1.0
1  2.0  NaN  NaN
2  NaN  NaN  3.0

In [238]:
df.dropna()

     A    B    C
0  1.0  1.0  1.0

In [239]:
df.dropna(thresh= 2)

     A    B    C
0  1.0  1.0  1.0

In [235]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [236]:
df.fillna(value=df['A'].mean())

     A    B    C
0  1.0  1.0  1.0
1  2.0  1.5  1.5
2  1.5  1.5  3.0

In [237]:
df.fillna(value=df['C'].mean())

     A    B    C
0  1.0  1.0  1.0
1  2.0  2.0  2.0
2  2.0  2.0  3.0

In [240]:
###Group By

In [241]:
data = {'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [242]:
df = pd.DataFrame(data)

In [243]:
df

    Person  Sales company
0      Sam    200    GOOG
1  Charlie    120    GOOG
2      Amy    340    MSFT
3  Vanessa    124    MSFT
4     Carl    243      FB
5    Sarah    350      FB

In [246]:
by_comp = df.groupby('company')

In [247]:
by_comp.mean()

         Sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [248]:
by_comp.std()

              Sales
company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [249]:
by_comp.std().loc['FB']

Sales    75.660426
Name: FB, dtype: float64

In [253]:
df.groupby('company').describe().transpose()

company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000